tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_dma.h
/** @defgroup DMA_BTC_Suspend DMA BTC Suspend Mode
  * @{
  */
#define DMA_BTC_SUSPEND_DISABLE   (0x00000000U)                  /*!< Disable suspend transfer after block transfer completion interrupt    */
#define DMA_BTC_SUSPEND_ENABLE    ((uint32_t)DMA_CCR_BTCSUSP)    /*!< Enable suspend transfer after block transfer completion interrupt      */
/**
  * @}
  */

/** @defgroup DMA_interrupt_enable_definitions DMA interrupt enable definitions
  * @{
  */
#define DMA_IT_TC                         ((uint32_t)DMA_CCR_TCIE)
#define DMA_IT_BTC                        ((uint32_t)DMA_CCR_BTCIE)
#define DMA_IT_HBT                        ((uint32_t)DMA_CCR_HBTIE)
#define DMA_IT_TE                         ((uint32_t)DMA_CCR_TEIE)
/**
  * @}
  */

/** @defgroup DMA_flag_definitions DMA flag definitions
  * @{
  */
#define DMA_FLAG_TC1                      0x00000001U
#define DMA_FLAG_BTC1                     0x00000002U
#define DMA_FLAG_HBT1                     0x00000004U
#define DMA_FLAG_TE1                      0x00000008U
#define DMA_FLAG_TC2                      0x00000010U
#define DMA_FLAG_BTC2                     0x00000020U
#define DMA_FLAG_HBT2                     0x00000040U
#define DMA_FLAG_TE2                      0x00000080U
#define DMA_FLAG_TC3                      0x00000100U
#define DMA_FLAG_BTC3                     0x00000200U
#define DMA_FLAG_HBT3                     0x00000400U
#define DMA_FLAG_TE3                      0x00000800U
/**
  * @}
  */



/** @defgroup DMA_Channel_map DMA Channel map
  * @{
  */
#define DMA_CHANNEL_MAP_ADC               0U
#define DMA_CHANNEL_MAP_SPI1_RX           3U
#define DMA_CHANNEL_MAP_SPI1_TX           4U
#define DMA_CHANNEL_MAP_SPI2_RX           5U
#define DMA_CHANNEL_MAP_SPI2_TX           6U
#define DMA_CHANNEL_MAP_USART1_RX         7U
#define DMA_CHANNEL_MAP_USART1_TX         8U
#define DMA_CHANNEL_MAP_UART1_RX          11U
#define DMA_CHANNEL_MAP_UART1_TX          12U
#define DMA_CHANNEL_MAP_LPUART1_RX        13U
#define DMA_CHANNEL_MAP_LPUART1_TX        14U
#define DMA_CHANNEL_MAP_I2C1_RX           15U
#define DMA_CHANNEL_MAP_I2C1_TX           16U
#define DMA_CHANNEL_MAP_TIM1_CH1          19U
#define DMA_CHANNEL_MAP_TIM1_CH2          20U
#define DMA_CHANNEL_MAP_TIM1_CH3          21U
#define DMA_CHANNEL_MAP_TIM1_CH4          22U
#define DMA_CHANNEL_MAP_TIM1_COM          23U
#define DMA_CHANNEL_MAP_TIM1_TRG          24U
#define DMA_CHANNEL_MAP_TIM1_UP           25U

#define DMA_CHANNEL_MAP_TIM3_CH1          32U
#define DMA_CHANNEL_MAP_TIM3_CH2          33U
#define DMA_CHANNEL_MAP_TIM3_CH3          34U
#define DMA_CHANNEL_MAP_TIM3_CH4          35U
#define DMA_CHANNEL_MAP_TIM3_UP           36U
#define DMA_CHANNEL_MAP_TIM3_TRG          37U

#define DMA_CHANNEL_MAP_TIM16_CH1         45U
#define DMA_CHANNEL_MAP_TIM16_UP          46U
#define DMA_CHANNEL_MAP_TIM17_CH1         47U
#define DMA_CHANNEL_MAP_TIM17_UP          48U

#define DMA_CHANNEL_MAP_END               59U
/**
 * @}
 */





/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DMA_Exported_Macros DMA Exported Macros
  * @{
  */

/** @brief  Reset DMA handle state
  * @param  __HANDLE__ DMA handle.
  * @retval None
  */
#define __HAL_DMA_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_DMA_STATE_RESET)

/**
  * @brief  Enable the specified DMA Channel.
  * @param  __HANDLE__ DMA handle
  * @retval None
  */
#define __HAL_DMA_ENABLE(__HANDLE__)        ((__HANDLE__)->Instance->CCR |= DMA_CCR_EN)

/**
  * @brief  Disable the specified DMA Channel.
  * @param  __HANDLE__ DMA handle
  * @retval None
  */
#define __HAL_DMA_DISABLE(__HANDLE__)       ((__HANDLE__)->Instance->CCR &= ~DMA_CCR_EN)


/* Interrupt & Flag management */

/**
  * @brief  Enables the specified DMA Channel interrupts.
  * @param  __HANDLE__ DMA handle
  * @param __INTERRUPT__ specifies the DMA interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval None
  */
#define __HAL_DMA_ENABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->CCR |= (__INTERRUPT__))

/**
  * @brief  Disables the specified DMA Channel interrupts.
  * @param  __HANDLE__ DMA handle
  * @param __INTERRUPT__ specifies the DMA interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval None
  */
#define __HAL_DMA_DISABLE_IT(__HANDLE__, __INTERRUPT__)  ((__HANDLE__)->Instance->CCR &= ~(__INTERRUPT__))

/**
  * @brief  Checks whether the specified DMA Channel interrupt is enabled or disabled.
  * @param  __HANDLE__ DMA handle
  * @param  __INTERRUPT__ specifies the DMA interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval The state of DMA_IT (SET or RESET).
  */
#define __HAL_DMA_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  (((__HANDLE__)->Instance->CCR & (__INTERRUPT__)))

/**
  * @brief  Returns the number of remaining data units in the current DMAy Channelx transfer.
  * @param  __HANDLE__ DMA handle
  *
  * @retval The number of remaining data units in the current DMA Channel transfer.
  */
#define __HAL_DMA_GET_COUNTER(__HANDLE__) ((__HANDLE__)->Instance->CNDTR)





/**
  * @}
  */

