tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_dma.h
/* Include DMA HAL Extension module */
#include "py32f032_hal_dma_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DMA_Exported_Functions
  * @{
  */

/** @addtogroup DMA_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_DeInit (DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group2
  * @{
  */
/* Input and Output operation functions *****************************************************/
HAL_StatusTypeDef HAL_DMA_Start (DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
HAL_StatusTypeDef HAL_DMA_Start_IT(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_PollForTransfer(DMA_HandleTypeDef *hdma, uint32_t CompleteLevel, uint32_t Timeout);
void              HAL_DMA_IRQHandler(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef HAL_DMA_RegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void (* pCallback)( DMA_HandleTypeDef * _hdma));
HAL_StatusTypeDef HAL_DMA_UnRegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID);
void              HAL_DMA_ChannelMap(DMA_HandleTypeDef *hdma, uint32_t MapReqNum);

/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group3
  * @{
  */
/* Peripheral State and Error functions ***************************************/
HAL_DMA_StateTypeDef HAL_DMA_GetState(DMA_HandleTypeDef *hdma);
uint32_t             HAL_DMA_GetError(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup DMA_Private_Macros DMA Private Macros
  * @{
  */
#define IS_DMA_DIRECTION(DIRECTION) (((DIRECTION) == DMA_PERIPH_TO_MEMORY ) || \
                                     ((DIRECTION) == DMA_MEMORY_TO_PERIPH)  || \
                                     ((DIRECTION) == DMA_MEMORY_TO_MEMORY))
                                     
#define IS_DMA_PERIPHERAL_INC_STATE(STATE) (((STATE) == DMA_PADDR_FIX) || \
                                            ((STATE) == DMA_PADDR_INC) || \
                                            ((STATE) == DMA_PADDR_DEC))

#define IS_DMA_MEMORY_INC_STATE(STATE) (((STATE) == DMA_MADDR_FIX) || \
                                        ((STATE) == DMA_MADDR_INC) || \
                                        ((STATE) == DMA_MADDR_DEC))
                                        
#define IS_DMA_PERIPHERAL_DATA_SIZE(SIZE) (((SIZE) == DMA_PDATAALIGN_BYTE)     || \
                                           ((SIZE) == DMA_PDATAALIGN_HALFWORD) || \
                                           ((SIZE) == DMA_PDATAALIGN_WORD))

#define IS_DMA_MEMORY_DATA_SIZE(SIZE) (((SIZE) == DMA_MDATAALIGN_BYTE)     || \
                                       ((SIZE) == DMA_MDATAALIGN_HALFWORD) || \
                                       ((SIZE) == DMA_MDATAALIGN_WORD ))

#define IS_DMA_MODE(MODE) (((MODE) == DMA_NORMAL )  || \
                           ((MODE) == DMA_FINITE_CIRCULAR )  || \
                           ((MODE) == DMA_INFINITE_CIRCULAR))
                           
#define IS_DMA_PRIORITY(PRIORITY) (((PRIORITY) == DMA_PRIORITY_0) || \
                                   ((PRIORITY) == DMA_PRIORITY_1) || \
                                   ((PRIORITY) == DMA_PRIORITY_2))

#define IS_DMA_PERIPHERAL_RELOAD(STATE) (((STATE) == DMA_PRELOAD_ENABLE) || \
                                         ((STATE) == DMA_PRELOAD_DISABLE))

#define IS_DMA_MEMORY_RELOAD(STATE) (((STATE) == DMA_MRELOAD_ENABLE) || \
                                     ((STATE) == DMA_MRELOAD_DISABLE))

#define IS_DMA_BLOCK_SIZE(SIZE) ((SIZE) <= 65535U)

#define IS_DMA_TRANSFER_MODE(MODE) (((MODE) == DMA_TRANSFER_SINGLE) || \
                                    ((MODE) == DMA_TRANSFER_BULK))

#define IS_DMA_ARB_MODE(MODE) (((MODE) == DMA_ARB_FAST) || \
                               ((MODE) == DMA_ARB_POLL))

#define IS_DMA_BTC_SUSPEND(STATE) (((STATE) == DMA_BTC_SUSPEND_DISABLE) || \
                                   ((STATE) == DMA_BTC_SUSPEND_ENABLE))

#define IS_DMA_MAP_VALUE(VALUE)  (VALUE < DMA_CHANNEL_MAP_END)



/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F032_HAL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
